{
  "error": {
    "title": "Page d'erreur !",
    "Pattern": "Format invalid",
    "http": {
      "400": "Mauvaise requête.",
      "403": "Vous n'avez pas les droits pour accéder à cette page.",
      "404": "La page n'existe pas.",
      "405": "Le verbe HTTP que vous avez utilisé n'est pas reconnu par cet URL.",
      "500": "Erreur interne du serveur."
    },
    "concurrencyFailure": "Un autre utilisateur a modifié ces données en même temps que vous. Vos changements n'ont pas été sauvegardés.",
    "validation": "Erreur de validation côté serveur.",
    "achat.pricingIssue": "Aucun tarif d'achat n'a été trouvé pour le fournisseur et l'unité d'achat fournis",
    "vente.pricingIssue": "Aucun tarif de vente n'a été trouvé pour le client, le produit et l'unité de vente fournis",
    "transport.pricingIssue": "Aucun tarif de transport n'a été trouvé pour le client, le produit et l'unité fournis",
    "error.trajetNotFound": "Aucun trajet n'a été trouvé pour la description fournie",
    "km.invalide": "Le kilométrage initial ne peut être supérieur au kilométrage final",
    "periode.invalide": "La date de début ne peut être postérieure à la date de fin",
    "br.date.future": "La date de réception ne peut être dans le future",
    "error.trajetWithCommissionUndefined": "Le trajet sélectionné n'a pas de commission de définie",
    "error.trajetManyCommission": "Plusieurs commissions ont été trouvées pour le trajet sélectionné",
    "livraison.save.date.caisse.future": "La date du bon de caisse ne peut être dans le future",
    "livraison.save.date.livraison.future": "La date de livraison ne peut être dans le future",
    "livraison.save.date.caisse.sup.date.livraison": "La date du bon de caisse ne peut être antérieure à la date de livraison",
    "livraison.save.date.caisse.ant.date.commande": "La date du bon de caisse ne peut être antérieure à la date du bon de commande",
    "livraison.save.date.livraison.ant.date.commande": "La date de livraison ne peut être antérieure à la date du bon de commande",
    "tarif.tarifAlreadyExists": "Ce tarif a été déjà saisi",
    "item.duplicated": "L'élément saisi est déjà existant",
    "exercice.comptable.livraison": "L'année de la date de livraison ne peut être en dehors de l'exercice comptable en cours",
    "exercice.comptable.commande": "L'année de la date de commande ne peut être en dehors de l'exercice comptable en cours",
    "bl.client.exist": "Le N° du bon de livraison a été déjà saisi pour le client choisi",
    "quantite.gasoil.insuffisante": "La quantité du gasoil à vendre ne peut dépasser la quantité disponible",
    "km.parcouru.invalide": "La distance parcourue ne peut dépasser 1000 km !",
    "gasoil.citerne.non-reconnue": "La citerne renseignée est non reconnue !",
    "gasoil.quantite.non.fournie": "Quantite en Litre non renseignée !",
    "gasoil.prix.unitaire.non.fournie": "Prix unitaire non renseigné !",
    "gasoil.bon.gasoil.non.fournie": "Numero du bon de gasoil non renseigné !",
    "gasoil.kilometrage.initial.non.fournie": "Kilometrage initial non renseigné ",
    "gasoil.kilometrage.final.non.fourni": "Kilometrage final non renseigné",
    "gasoil.citerne.non.fournie": "Citerne non renseignée",
    "stock.insuffisant": "Le stock du dépôt sélectionné est insuffisant: {0}",
    "depot.introuvable": "Le dépôt sélectionné est introvable",
    "vente-gros.bon-achat-ou-depot": "Vous devez spécifier la source en renseignant soit le bon d'achat du gasoil ou le dépot"
  }
}
